<?php
session_start();
// Include the database configuration file
@include 'config.php';

$message = ""; // Initialize an empty message variable

// Check if the form is submitted
if(isset($_POST['submit'])){
    // Sanitize and retrieve form data
    $name = filter_var($_POST['name'], FILTER_SANITIZE_STRING);

    // Define color mappings for colleges
    $college_colors = array(
        "پەروەردەی بنەڕەت" => "purple",
        "ئەندازیاری" => "gold",
        "کارگێڕی و ئابوری"=> "aqua",
      "بازرگانی"=> "red",
      "هونەرە جوانەکان"=> "green",
      "زانستە مرۆڤاییەتیەکان"=> "orange",
    );
    
    $college_Images = array (
      "پەروەردەی بنەڕەت"=> "bashakan/pa.jpg",
      "ئەندازیاری"=> "bashakan/and.jpg",
      "کارگێڕی و ئابوری"=> "bashakan/kar.jpg",
      "بازرگانی"=> "bashakan/ba.jpg",
      "هونەرە جوانەکان"=> "bashakan/hw.jpg",
      "زانستە مرۆڤاییەتیەکان"=> "bashakan/zm.jpg",
    );




   






    $college_details = array (
        "پەروەردەی بنەڕەت"=> " 
        لە ساڵی ٢٠٠٣-٢٠٠٤ دامەزرا بە ناوی کۆلێژی (مامۆستایان)
         لەسەر داوای وەزارەتی پەروەردەی هەرێمی کوردستان بەهۆی پێویستی زۆریان بە مامۆستای شارەزا و بەئەزموون،
         لە سەرەتادا سیستمی خوێندن گشتی بوو، بەڵام لە ساڵانی دواتردا چەندین بەشی جیاجیا کرانەوە
         وەک (زانستە بیرکارییەکان – زمانی کوردی – پەروەردەی هونەری – باخچەی ساوایان
         – زانستی کۆمەڵایەتی – زمانی ئینگلیزی – زانستی کۆمپیوتەر – پەروەردەی تایبەت).
         دواتر لە ساڵی (٢٠٠٥-٢٠٠٦) ناوی کۆلێژەکە لە ناوی کۆلێژی 
        (مامۆستایان) گۆڕدرا بۆ ناوی (کۆلێژی پەروەردەی بنەڕەتی), هەروەها خوێندکار لە سەرجەم بەشەکان
         لە ڕێگەی دوو سیستەمەوە ناویان تۆماردەکرێت، کە بریتین لە سیستەمی زانکۆلاین و ڕاستەوخۆ.
          خوێندکاران لە سەرجەم بەشەکانی کۆلێژ لە ڕێگەی سیستمی زانکۆلاین وەردەگیرێن،
          جگە لە بەشی هونەر، کە ڕاستەوخۆ خوێندکار داواکاریی تۆماردەکات.
        
        
        
        
        
        
        
        
        
        ",

        "ئەندازیاری"=> "
        
        کۆلێژی ئەندازیاری (CoE) یەکێک بوو لەو سێ کۆلێژەی، کە لەگەڵ دامەزراندنی زانکۆی سلێمانی لە ساڵی ١٩٦٨ کرایەوە،
         کۆلێژەکەمان بە بەشی ئەندازیاریی شارستانی دەستیپێکرد،
         کە ٤٤ خوێندکاری بۆ ساڵی یەکەمی خوێندنی (١٩٦٨-١٩٦٩) وەرگرت. 
         لە ساڵی (١٩٧٣ – ١٩٧٤) بەشی ئەندازیاریی کارەبا کرایەوە
         بۆ کۆلێژەکەمان بە وەرگرتنی ٣٠ خوێندکار. یەکەم پۆلی
         دەرچووی بەکالۆریۆس لە ساڵی (١٩٧١-١٩٧٢) بوو. ژمارەی خوێندکاران بە
         درێژایی ساڵانی دواتر، بە شێوەیەکی بەردەوام لە زیادبووندا بوو.
         تا  ساڵی ١٩٨١، ١٤٥١ خوێندکاری بەکالۆریۆس لە
         کۆلێژەکەمان دەرچوون، لەو ساڵەدا زانکۆی سلێمانی 
        داخراو گوێزرایەوە بۆ شاری هەولێر بۆ (زانکۆی سەلاحەدین). 
        دوای ئەوەی لە ساڵی (١٩٩٢) زانکۆی سلێمانی
         لە شاری سلێمانی دامەزرایەوە، کۆلێژی ئەندازیارییش لە
         (ئەیلوولی ١٩٩٥) بە بەشی ئاودێری (سەرچاوەکانی ئاو) کرایەوە.
         ساڵی (١٩٩٦-١٩٩٧)بەشی بیناسازیی بینا کرایەوە،
         ساڵی (١٩٩٩-٢٠٠٠) بەشی ئەندازیاریی تەلارسازی و ساڵی
         (٢٠٠٤-٢٠٠٥) بەشی ئەندازیاریی کارەبا کرایەوە. لە نێوان ساڵانی 
        (١٩٩٥ بۆ ٢٠٢١)دا (٤٧٤٨) ئەندازیار بە بڕوانامەی بەکالۆریۆس لە
         کۆلێژی ئەندازیاری دەرچوون بە ڕێژەی لە سەدا ٥٥% نێر بۆ ٤٥% مێ.
        
        ",




        "کارگێڕی و ئابوری"=> "
        
        دوای هەشت ساڵ لە دامەزراندنی زانکۆی سلێمانی/ لە ساڵی ١٩٦٨دا، کۆلێژی کارگێڕی و ئابووری لە ساڵی ١٩٧٦ دامەزرا،
         یەکێکە لە کۆنترین کۆلێژەکانی زانکۆی سلێمانی، بەهۆی گرنگیی ئەم کۆلێژەوە، لە ساڵی ١٩٩٩ لە هەردوو بواری
         (بەڕێوەبردن و ئابووری)دا نوێکرایەوە، کە گرنگترین دوو الیەنی گەشەپێدانی بازرگانی و کۆمەاڵیەتین.
         بۆیە بە یەکێک لە گرنگترین کۆلێژەکان دادەنرێت، کە کاریگەریی ڕاستەوخۆی هەیە لەسەر هەموو ئاستەکانی کۆمەڵگاو
         پەیکاڵە لەگەڵ هزری کارگێڕیی و ئابووریی کۆمەڵدا، ئەویش بەوپێیەی ئەو خوالنەی لەم کۆلێژە دەخوێندرێن، 
        یاریدەدەرن بۆ دۆزینەوەی چارەسەری گونجاو بۆ کێشەکانی ڕۆژانەی کۆمەڵگا و کاریگەری لەسەر گەشەپێدانی
         واڵت و نەوەکانی داهاتوو دادەنێت. شایەنی باسیشە، لە ماوەی سێ ساڵی دامەزراندنیدا ئامانجەکەی
        بەدەستهێناوە، ئەویش بەهۆی کردنەوەی دوو خولی کارگێڕی، کە ئامانج لێیان پەرەپێدانی توانست
         و تواناکانی خوێندکار بووە، تا کاریگەری لەسەر گەشەپێدانی بازرگانی و ئابووری دابنێت.
        
        ",




        "بازرگانی"=> "
        
        
        کۆلێژی بازرگانی وەک کۆلێژێکی ئەهلیی ئێواران، بەپێی فەرمانێکی ئەنجومەنی وەزارەتی خوێندنی باڵا و
         توێژینەوەی زانستی (٢١ی ئاب ١٩٩٧) دواتر دامەزراوە. لە ساڵی (٢٠٠٠)ەوە پەیوەستبوو بە زانکۆی سلێمانیەوە،
         لێرەوە بوو بە یەکێک لە کۆلێژەکانی زانکۆکەمان. لە سەرەتاوە کۆلێژەکە ستراتیژی خۆپاراستنی
         گرتەبەر تا ساڵی (٢٠١٢)، بەاڵم بەهۆی بڕیارێکی ئەنجومەنی وەزارەتی حکومەتی هەرێم،
         کرێی وەرگرتنی خوێندکاران لابرا بوو، بۆیە ناوتۆمارکردن بوو بە بێبەرامبەر  
        
        ",




        "هونەرە جوانەکان"=> "
        
        کۆلێژەکەمان لە ساڵی (١٩٩٨-١٩٩٩) دامەزراوەو لە بەشەکانی (هونەری پلاستیک و مۆسیقا) پێکهاتووە،
         بەشی هونەری پلاستیکی لە
          (نیگارکێشی و پەیکەرسازی و سیرامیک) پێکهاتووە، کە تێیدا خوێندکاران، بەکالۆریۆس و ماجستێر و دکتۆرا دەخوێنن. بەشی مۆسیقا 
          لە (نمایش و ئاوازدانان و ئێتنۆمۆسیقالۆجی) پێکهاتووە، هەروەها خوێندن بۆ بڕوانامەی بەکالۆریۆس هەیە.
          کۆلێژەکەمان هەوڵدەدات کادرەکانی بە شێوەیەکی ئەکادیمی لەبواری هونەرە جوانەکاندا پێشبخات
          و بە بڵاوکردنەوەی هۆشیاریی هونەر لە کوردستان بەتایبەتی و ناوچەکە بەگشتی.
     
        ",




        "زانستە مرۆڤاییەتیەکان"=> "
        
        دوابەدوای کردنەوەی زانکۆی سلێمانی لە ساڵی (١٩٩٢)، ئەم کۆلێژە یەکێک بوو لەو چوار کۆلێژەی لەو سەردەمەدا هەبوو،
         لەوانەش کۆلێژی زمان، کە لەم بەشەکانی: (کوردی، عەرەبی و ئینگلیزی) پێکهاتبوو،
          لە ساڵانی (١٩٩٣-١٩٩٤) بەشی (خوێندنی ئیسلامی- جوگرافیا) کرایەوە. لە ساڵی (١٩٩٧) ناوی کۆلێژەکە
          بۆ (زانستە مرۆڤایەتییەکان) گۆڕدرا. لە ساڵانی (١٩٩٨-١٩٩٩) بەشی (مێژوو و کۆمەڵناسی و بەشی میدیا) کرانەوە.
          بەهۆی فراوانبوونی کۆلێژەکە، بەسەر کۆلێژی زمان و کۆلێژی زانستە مرۆڤایەتییەکاندا، دابەشکرا. 
         هەروەها لە ساڵانی (٢٠١٣-٢٠١٤)، بەشی شوێنەوارناسی کرایەوە، بەشی خزمەتگوزاریی کۆمەڵایەتیش لە ساڵی (٢٠١٤-٢٠١٥) کرایەو
         ە. لە ئێستادا کۆلێژ لە بەشانە پێکدێت. (مێژوو\ جوگرافیا\ کۆمەڵناسی\ میدیا\ شوێنەوار و خزمەتگوزاریی کۆمەڵایەتی)،
          لە ساڵی ٢٠١٣ەوە بەشی ئیسلامییەکان جیابووەوەو سەربە کۆلێژی زانستە ئیسلامییەکانە. شایانی باسە، کە کۆلێژەکە
          لە دابینکردنی ستافی پێشکەوتوو (پسپۆر و ئەندامانی ئەکادیمی) لە هەموو پسپۆڕییەکانی سەرەوەدا سەرکەوتوو بوو.
          
        ",
      );


      $college_robimages = array (
        "پەروەردەی بنەڕەت"=> "robakan/parwarda.png",
        "ئەندازیاری"=>  "robakan/andazyari.png",
        "کارگێڕی و ئابوری"=>  "robakan/kargery.png",
        "بازرگانی"=>  "robakan/bazrgany.png",
        "هونەرە جوانەکان"=>  "robakan/hwnara.png",
        "زانستە مرۆڤاییەتیەکان"=>  "robakan/zanst.png",
      );



      $college_bcolors = array(
        "پەروەردەی بنەڕەت" => "purple",
        "ئەندازیاری" => "gold",
        "کارگێڕی و ئابوری"=> "aqua",
      "بازرگانی"=> "red",
      "هونەرە جوانەکان"=> "green",
      "زانستە مرۆڤاییەتیەکان"=> "orange",
    );



    
    // Get the color for the selected college
    $color = isset($college_colors[$name]) ? $college_colors[$name] : "white";
    $image = isset($college_Images[$name]) ? $college_Images[$name] : "college.jpg";
    $details = isset($college_details[$name]) ? $college_details[$name] : " "; 
    $robimage = isset($college_robimages[$name]) ? $college_robimages[$name] : " "; // Default image if not found
    $bgcolors = isset($college_bcolors[$name]) ? $college_bcolors[$name] : " ";
    try {
        // Prepare and execute a query to insert the selected college into the database
        $insert_college = $conn->prepare("INSERT INTO `college` (name, color,image,details,robimage,bgcolors) VALUES (?,?,?,?,?,?)");
        if ($insert_college->execute([$name, $color,$image,$details,$robimage,$bgcolors])) {
            $message = 'College added successfully!';
        } else {
            $message = 'Failed to add college!';
        }
    } catch (PDOException $e) {
        $message = 'Error: ' . $e->getMessage();
    }

    // Redirect to home.php
    header('location:home.php');
}
?>
<!DOCTYPE html>
<html lang="kurdish">
<head>
  <meta charset="	utf8_general_ci">
    <meta name="viewport" content="width=device-width, initial-scale=1.0" >
    <title>College Image</title>
    <!-- Include Font Awesome for icons (optional) -->
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.1/css/all.min.css">
    <!-- Include your custom CSS file -->
    <link rel="stylesheet" href="css/admin_style.css">
</head>
<body>
    <section class="add-products">
        <div class="container">
            <form id="collegeForm" method="post">
                <div class="select">
                    <select id="collegeSelect" name="name" class="box" required style="font-family:HS alkitab; width:100%">
                    <option value="" selected disabled>کۆلێژ دیاری بکە</option>
                        <option value="پەروەردەی بنەڕەت">پەروەردەی بنەڕەت</option>
                        <option value="ئەندازیاری">ئەندازیاری</option>
                        <option value="کارگێڕی و ئابوری">کارگێڕی و ئابوری</option>
                        <option value="بازرگانی">بازرگانی</option>
                        <option value="هونەرە جوانەکان">هونەرە جوانەکان</option>
                        <option value="زانستە مرۆڤاییەتیەکان">زانستە مرۆڤاییەتیەکان</option>
                        <!-- Add more colleges here -->
                    </select>
                </div>
                <input type="submit" class="btn" value="دیاریکردن" name="submit" style="font-family:HS alkitab">
            </form>
        </div>
    </section>
</body>
</html>
